{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "(&lt;metadata.title&gt;)",
  "language": "iw",
  "home_page_url": "https://&lt;metadata.url&gt;.netlify.app/",
  "feed_url": "https://&lt;metadata.jsonfeed.url&gt;.netlify.app/feed/feed.json",
  "description": "Docs, Guides and specs",
  "author": {
    "name": "Yaki Kimhi",
    "url": "/about/"
  },
  "items": [{
      "id": "https://&amp;lt;metadata.url&amp;gt;.netlify.app/11ty-Images/",
      "url": "https://&amp;lt;metadata.url&amp;gt;.netlify.app/11ty-Images/",
      "title": "Obsidian-11ty Images",
      "content_html": "<h2 id=\"how-to-config-your-obsidian-vault\" tabindex=\"-1\">How to config your obsidian vault <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/11ty-Images/#how-to-config-your-obsidian-vault\" aria-hidden=\"true\" target=\"_self\">#</a></h2>\n<p>Under <code>Files &amp; Links</code> define the <code>Default location for new attachments</code> attribute to be any value <strong>exept</strong> the <code>Same folder as current file</code> .  My definition and recomendation:<br />\n<img src=\"https://&lt;metadata.url&gt;.netlify.app/attch/Pasted%20image%2020220424171759.png\" alt=\"|90%?my definition\" title=\"my definition\" width=\"90%\" /><br />\nIt's a perfect combination of manage privacy as well as lighting site and publish easily.</p>\n<h2 id=\"mapping-the-attachments-in-.eleventy.js-file\" tabindex=\"-1\">mapping the attachments in .eleventy.js file <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/11ty-Images/#mapping-the-attachments-in-.eleventy.js-file\" aria-hidden=\"true\" target=\"_self\">#</a></h2>\n<p>change the value of the variable <code>publishAttachementsDir</code> to contain the output directory. for exemple:</p>\n
<pre><code class="language-">const publishAttachementsDir = 'attch';\n</code></pre>
\n<p>for every attachments directory you have to map it to the <code>_site/&lt;publishAttachementsDir&gt;</code> directory.<br />\nSo below this line you can add as many mapping as needded for your attachments folders you may like to share from your vault to your site.<br />\nIt can be done through:</p>\n
<pre><code class="language-">eleventyConfig.addPassthroughCopy({&lt;fromDir&gt;:&lt;toDir&gt;});\n</code></pre>
\n<p>for example:</p>\n
<pre><code class="language-">eleventyConfig.addPassthroughCopy({&quot;src/MyObsidian/public/attachments&quot;:`${publishAttachementsDir}`});\n</code></pre>
\n<h2 id=\"publish-image-to-the-site\" tabindex=\"-1\">Publish image to the site <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/11ty-Images/#publish-image-to-the-site\" aria-hidden=\"true\" target=\"_self\">#</a></h2>\n<p>In your note, you can include your image with the format <code>![alt|width?title](src)</code> for example:<br />\n<img src=\"https://imgs.developpaper.com/guest/2019/01/logo.png\" alt=\"My Alt text|200px?This is the image\" title=\"This is the image\" width=\"200px\" /></p>\n
<pre><code class="language-">![My Alt text|200px?This is the image](https://imgs.developpaper.com/guest/2019/01/logo.png)\n</code></pre>
\n<p>Example from the local files (stayed at <code>src/MyObsidian/public/attachments</code>):<br />\n<img src=\"https://&lt;metadata.url&gt;.netlify.app/attch/msedge_0sbOL3eK3s.png\" alt=\"My Hill sprints |100%?hill sprints graph \" title=\"hill sprints graph \" width=\"100%\" /></p>\n
<pre><code class="language-">![My Hill sprints |100%?hill sprints graph](msedge_0sbOL3eK3s.png)\n</code></pre>
\n",
      "date_published": "2022-04-24T00:00:00Z"
    },{
      "id": "https://&amp;lt;metadata.url&amp;gt;.netlify.app/firstpost/",
      "url": "https://&amp;lt;metadata.url&amp;gt;.netlify.app/firstpost/",
      "title": "About HTTP-Post.",
      "content_html": "<p><img src=\"https://&lt;metadata.url&gt;.netlify.app/attch/HTTP_logo.svg\" alt=\"http|100px\" width=\"100px\" /></p>\n<h2 id=\"post\" tabindex=\"-1\">Post <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/firstpost/#post\" aria-hidden=\"true\" target=\"_self\">#</a></h2>\n<p>In computing, POST is a request method supported by HTTP used by the World Wide Web. By design, the POST request method requests that a web server accept the data enclosed in the body of the request message, most likely for storing it. It is often used when uploading a file or when submitting a completed web form.</p>\n<p>In contrast, the HTTP GET request method retrieves information from the server. As part of a GET request, some data can be passed within the URL's query string, specifying (for example) search terms, date ranges, or other information that defines the query.</p>\n<p>As part of a POST request, an arbitrary amount of data of any type can be sent to the server in the body of the request message. A header field in the POST request usually indicates the message body's Internet media type.</p>\n<h2 id=\"posting-data\" tabindex=\"-1\">Posting data <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/firstpost/#posting-data\" aria-hidden=\"true\" target=\"_self\">#</a></h2>\n<p>The world wide Web and HTTP are based on a number of request methods or 'verbs', including POST and GET as well as PUT, DELETE, and several others. Web browsers normally use only GET and POST, but RESTful online apps make use of many of the others. POST's place in the range of HTTP methods is to send a representation of a new data entity to the server so that it will be stored as a new subordinate of the resource identified by the URI. For example, for the URI <a href=\"http://example.com/customers\" target=\"_self\" class=\"external-link\">http://example.com/customers</a>, POST requests might be expected to represent new customers, each including their name, address, contact details and so on. Early website designers strayed away from this original concept in two important ways. First, there is no technical reason for a URI to textually describe the web resource subordinate to which POST data will be stored. In fact, unless some effort is made, the last part of a URI will more likely describe the web application's processing page and its technology, such as <a href=\"http://example.com/applicationform.php\" target=\"_self\" class=\"external-link\">http://example.com/applicationform.php</a>. Secondly, given most web browsers' natural limitation to use only GET or POST, designers felt the need to re-purpose POST to do many other data submission and data management tasks, including the alteration of existing records and their deletion.</p>\n<p>Efforts by some influential writers to remedy the first point began as early as 1998. Web application frameworks such as Ruby on Rails and others make it easier for designers to provide their users with semantic URLs. With regard to the second point, it is possible to use client-side scripting, or to write standalone apps, to make use of the other HTTP methods where they are relevant, but outside of this most web forms that submit or alter server data continue to use POST for the purpose.</p>\n<p>That is not to say that every web form should specify method=&quot;post&quot; in its opening tag. Many forms are used to specify more precisely the retrieval of information from the server, without any intention of altering the main database. Search forms, for example, are ideally suited to having method=&quot;get&quot; specified.</p>\n<p>There are times when HTTP GET is less suitable even for data retrieval. An example of this is when a great deal of data would need to be specified in the URL. Browsers and web servers can have limits on the length of the URL that they will handle without truncation or error. Percent-encoding of reserved characters in URLs and query strings can significantly increase their length, and while Apache HTTP Server can handle up to 4,000 characters in a URL, Microsoft Internet Explorer is limited to 2,048 characters in any URL. Equally, HTTP GET should not be used where sensitive information, such as usernames and passwords, have to be submitted along with other data for the request to complete. Even if HTTPS is used, preventing the data from being intercepted in transit, the browser history and the web server's logs will likely contain the full URL in plaintext, which may be exposed if either system is hacked. In these cases, HTTP POST should be used</p>\n",
      "date_published": "2022-03-01T00:00:00Z"
    },{
      "id": "https://&amp;lt;metadata.url&amp;gt;.netlify.app/thirdpost/",
      "url": "https://&amp;lt;metadata.url&amp;gt;.netlify.app/thirdpost/",
      "title": "ORDS - Source Type Options",
      "content_html": "<h2 id=\"the-options-of-source-types\" tabindex=\"-1\">The options of source types <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/thirdpost/#the-options-of-source-types\" aria-hidden=\"true\" target=\"_self\">#</a></h2>\n<p>Defines the source implementation for the selected HTTP method.</p>\n<p>Options include:</p>\n<ul>\n<li><strong>Collection Query</strong> - Executes a SQL query and transforms the result set into an ORDS Standard JSON representation. Available when the HTTP method is GET. Result Format: JSON</li>\n<li><strong>Collection Query Item</strong> - Executes a SQL query returning one row of data into a ORDS Standard JSON representation. Available when the HTTP method is GET. Result Format: JSON</li>\n<li><strong>PL/SQL</strong> - Executes an anonymous PL/SQL block and transforms any OUT or IN/OUT parameters into a JSON representation. The htp.p function may also be used to emit custom JSON. Result Format: JSON</li>\n<li><strong>Media Resource</strong> - Executes a SQL Query conforming to a specific format and turns the resultset into a binary representation with an accompanying HTTP Content-Type header identifying the internet media type of the representation. The format of the SQL query should be:</li>\n</ul>\n
<pre><code class="language-">SELECT 'content_type', column FROM . . .\n</code></pre>
\n<blockquote>\n<p>where <em>'content_type'</em>  is a string passed to the browser to be used to identify the incoming data, for example <em>'image/jpeg'</em>, and <em>column</em> is the name of the column containing the source of the data being sent back. The Media Resource Source type is typically used for media objects, such as images, where the data will be directly handled by the recipient making the call.</p>\n</blockquote>\n<p><strong>NOTE:</strong> The following are considered deprecated as they represent options specific to APEX Based REST Services.</p>\n<ul>\n<li><strong>Query</strong> - Executes a SQL query and transforms the result set into either an ORDS legacy JavaScript Object Notation (JSON) or CSV representation, depending on the format selected. Available when the HTTP method is GET. Result Format: JSON or CSV</li>\n<li><strong>Query One Row</strong> - Executes a SQL query returning one row of data into an ORDS legacy JSON representation. Available when the HTTP method is GET. Result Format: JSON</li>\n<li><strong>Feed</strong> - Executes a SQL query and transforms the results into a JSON Feed representation. Each item in the feed contains a summary of a resource and a hyperlink to a full representation of the resource. The first column in each row in the result set must be a unique identifier for the row and is used to form a hyperlink of the form: <em>path/to/feed/{id}</em>, with the value of the first column being used as the value for <em>{id}</em>. The other columns in the row are assumed to summarize the resource and are included in the feed. A separate resource template for the full representation of the resource should also be defined. Result Format: JSON</li>\n</ul>\n",
      "date_published": "2018-01-24T00:00:00Z"
    },{
      "id": "https://&amp;lt;metadata.url&amp;gt;.netlify.app/secondpost/",
      "url": "https://&amp;lt;metadata.url&amp;gt;.netlify.app/secondpost/",
      "title": "Beitar Jerusalem - the Origin of the Soulゐ",
      "content_html": "<p>Read my other posts:<br />\n<a href=\"https://&lt;metadata.url&gt;.netlify.app/firstpost/\" target=\"_self\" class=\"external-link\">First post</a><br />\n<a href=\"https://&lt;metadata.url&gt;.netlify.app/thirdpost/\">Third post</a></p>\n<h2 id=\"beitar-jerusalem\" tabindex=\"-1\">Beitar Jerusalem <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/secondpost/#beitar-jerusalem\" aria-hidden=\"true\" target=\"_self\">#</a></h2>\n<p>Beitar Jerusalem Football Club (Hebrew: 注 专 转&quot;专 专砖, romanized: Moadon Kaduregel Beitar Yerushalayim), commonly known as Beitar Jerusalem (转&quot;专 专砖) or simply as Beitar (转&quot;专), is an Israeli football club based in the city of Jerusalem, that plays in the Israeli Premier League, the top tier in Israeli football. The club has traditionally worn kit colours of yellow and black. The team has played its home matches in Teddy Stadium. The stadium is the largest stadium in Israel with a capacity of 34,000.<br />\n<img src=\"https://upload.wikimedia.org/wikipedia/en/6/61/Beitar_Jerusalem.png\" alt=\"Beitar|50%\" width=\"50%\" /><br />\nThe club is one of <em><strong>the most popular</strong></em> in Israel and is among the Israeli clubs with the highest number of fans in the country. The club was founded in 1936 by Shmuel Kirschstein and David Horn, who chaired the similarly named Betar branch in Jerusalem. Several team members were also part of the outlawed Irgun and Lehi militias closely associated with the right-wing Revisionist Zionism movement. Beitar's fans have become a highly controversial political symbol in Israeli football culture, unofficially aligned with the Revisionist Zionist movement and to the right-wing Likud party. The club, whose fanbase is notorious for its anti-Arab racism and anti-Muslim religious bigotry, remains the only one in the Israel Premier League to have never signed an Arab player, although the club signed four non-Arab Muslim players in the past.</p>\n<h2 id=\"stadiums\" tabindex=\"-1\">Stadiums <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/secondpost/#stadiums\" aria-hidden=\"true\" target=\"_self\">#</a></h2>\n<h3 id=\"former-stadiums\" tabindex=\"-1\">Former Stadiums <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/secondpost/#former-stadiums\" aria-hidden=\"true\" target=\"_self\">#</a></h3>\n<p>Beitar held its first games as an professional football team in the &quot;Dajani field&quot;, which was located in the old Katamon neighborhood. After the War of Independence and the establishment of the State of Israel, the team's home was officially moved to the YMCA Stadium, which has since become the team's regular home ground, until 1991, when the team moved to Teddy Stadium.</p>\n<h3 id=\"teddy-stadium\" tabindex=\"-1\">Teddy Stadium <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/secondpost/#teddy-stadium\" aria-hidden=\"true\" target=\"_self\">#</a></h3>\n<p>Teddy Stadium, Beitar's home ground.<br />\nIn 1991, Beitar has moved to the Teddy Stadium, named after longtime Jerusalem mayor Teddy Kollek. Initially the stadium was two-sided and held 12,000 spectators. This was increased to 21,600 when a third side was completed in 1997. The fourth side of the stadium was completed in the summer of 2013 in anticipation of the UEFA under 21 championship hosted by Israel, increasing the capacity of the stadium to 34,000 seats.</p>\n<p>The ground has been dubbed Gehinom (lit. Hell) by club supporters, for the hostile atmosphere it presents to visiting teams and their fans.</p>\n<h3 id=\"training-ground\" tabindex=\"-1\">Training Ground <a class=\"md-header-link\" href=\"https://&lt;metadata.url&gt;.netlify.app/secondpost/#training-ground\" aria-hidden=\"true\" target=\"_self\">#</a></h3>\n<p>All of the departments of Beitar Jerusalem train in the training complex at Beit Vagan. The complex includes locker rooms for the alumni group and the youth department, gyms, physiotherapy rooms, dining room, cloakrooms and treatment rooms. The complex contains three training fields, two of them with synthetic grass. Each of the fields has two Tribunes on both sides, and all contain a total of about 750 seats.</p>\n<p>The club's offices have been in the complex since 2009, and there is a fan shop inside the complex that sells cheerleading and merchandise products for the group's fans.</p>\n",
      "date_published": "1998-05-09T00:00:00Z"
    }
  ]
}
